Revit 2027 API
SpatialElementGeometryCalculator Methods
The SpatialElementGeometryCalculator type exposes the following members.
Methods
Name | Description
CalculateSpatialElementGeometry |  Compute the spatial element geometry and returns the boundary face information.
CanCalculateGeometry |  This indicates whether the input spatial element is a valid one.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetOptions |  The options that control the calculation.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsRoomOrSpace |  This indicates whether the input spatial element is a room or a space.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace